Pavllick/eerie_leap_round_gauge/boards/waveshare/esp32s3_touch_amoled_1_75/esp32s3-qspi-pinctrl.h
/* ESP32 QSPI Pinctrl Definitions
 * Add these to include/zephyr/dt-bindings/pinctrl/esp32-pinctrl.h
 */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_PINCTRL_ESP32S3_QSPI_PINCTRL_H_
#define ZEPHYR_INCLUDE_DT_BINDINGS_PINCTRL_ESP32S3_QSPI_PINCTRL_H_

/* SPI2 (FSPI) QSPI Pin Definitions */

/* D0 (MOSI) - Standard SPI MOSI, also used as D0 in QSPI */
#define SPIM2_D0_GPIO0  ESP32_PINMUX(0,  ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO1  ESP32_PINMUX(1,  ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO2  ESP32_PINMUX(2,  ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO3  ESP32_PINMUX(3,  ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO4  ESP32_PINMUX(4,  ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO5  ESP32_PINMUX(5,  ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO6  ESP32_PINMUX(6,  ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO7  ESP32_PINMUX(7,  ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO8  ESP32_PINMUX(8,  ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO9  ESP32_PINMUX(9,  ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO10 ESP32_PINMUX(10, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO11 ESP32_PINMUX(11, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO12 ESP32_PINMUX(12, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO13 ESP32_PINMUX(13, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO14 ESP32_PINMUX(14, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO15 ESP32_PINMUX(15, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO16 ESP32_PINMUX(16, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO17 ESP32_PINMUX(17, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO18 ESP32_PINMUX(18, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO19 ESP32_PINMUX(19, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO20 ESP32_PINMUX(20, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO21 ESP32_PINMUX(21, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO26 ESP32_PINMUX(26, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO27 ESP32_PINMUX(27, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO28 ESP32_PINMUX(28, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO29 ESP32_PINMUX(29, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO30 ESP32_PINMUX(30, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO31 ESP32_PINMUX(31, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO32 ESP32_PINMUX(32, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO33 ESP32_PINMUX(33, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO34 ESP32_PINMUX(34, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO35 ESP32_PINMUX(35, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO36 ESP32_PINMUX(36, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO37 ESP32_PINMUX(37, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO38 ESP32_PINMUX(38, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO39 ESP32_PINMUX(39, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO40 ESP32_PINMUX(40, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO41 ESP32_PINMUX(41, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO42 ESP32_PINMUX(42, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO43 ESP32_PINMUX(43, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO44 ESP32_PINMUX(44, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO45 ESP32_PINMUX(45, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO46 ESP32_PINMUX(46, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO47 ESP32_PINMUX(47, ESP_FSPID_IN, ESP_FSPID_OUT)
#define SPIM2_D0_GPIO48 ESP32_PINMUX(48, ESP_FSPID_IN, ESP_FSPID_OUT)

/* D1 (MISO) - Standard SPI MISO, also used as D1 in QSPI */
#define SPIM2_D1_GPIO0  ESP32_PINMUX(0,  ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO1  ESP32_PINMUX(1,  ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO2  ESP32_PINMUX(2,  ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO3  ESP32_PINMUX(3,  ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO4  ESP32_PINMUX(4,  ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO5  ESP32_PINMUX(5,  ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO6  ESP32_PINMUX(6,  ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO7  ESP32_PINMUX(7,  ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO8  ESP32_PINMUX(8,  ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO9  ESP32_PINMUX(9,  ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO10 ESP32_PINMUX(10, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO11 ESP32_PINMUX(11, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO12 ESP32_PINMUX(12, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO13 ESP32_PINMUX(13, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO14 ESP32_PINMUX(14, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO15 ESP32_PINMUX(15, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO16 ESP32_PINMUX(16, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO17 ESP32_PINMUX(17, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO18 ESP32_PINMUX(18, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO19 ESP32_PINMUX(19, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO20 ESP32_PINMUX(20, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO21 ESP32_PINMUX(21, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO26 ESP32_PINMUX(26, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO27 ESP32_PINMUX(27, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO28 ESP32_PINMUX(28, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO29 ESP32_PINMUX(29, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO30 ESP32_PINMUX(30, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO31 ESP32_PINMUX(31, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO32 ESP32_PINMUX(32, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO33 ESP32_PINMUX(33, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO34 ESP32_PINMUX(34, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO35 ESP32_PINMUX(35, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO36 ESP32_PINMUX(36, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO37 ESP32_PINMUX(37, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO38 ESP32_PINMUX(38, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO39 ESP32_PINMUX(39, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO40 ESP32_PINMUX(40, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO41 ESP32_PINMUX(41, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO42 ESP32_PINMUX(42, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO43 ESP32_PINMUX(43, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO44 ESP32_PINMUX(44, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO45 ESP32_PINMUX(45, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO46 ESP32_PINMUX(46, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO47 ESP32_PINMUX(47, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)
#define SPIM2_D1_GPIO48 ESP32_PINMUX(48, ESP_FSPIQ_IN, ESP_FSPIQ_OUT)

