Pavllick/eerie_leap_round_gauge/boards/waveshare/esp32s3_touch_amoled_1_75/esp32s3-qspi-pinctrl.h
/* D2 (WP - Write Protect) - QSPI data line 2, bidirectional */
#define SPIM2_D2_GPIO0  ESP32_PINMUX(0,  ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO1  ESP32_PINMUX(1,  ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO2  ESP32_PINMUX(2,  ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO3  ESP32_PINMUX(3,  ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO4  ESP32_PINMUX(4,  ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO5  ESP32_PINMUX(5,  ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO6  ESP32_PINMUX(6,  ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO7  ESP32_PINMUX(7,  ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO8  ESP32_PINMUX(8,  ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO9  ESP32_PINMUX(9,  ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO10 ESP32_PINMUX(10, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO11 ESP32_PINMUX(11, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO12 ESP32_PINMUX(12, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO13 ESP32_PINMUX(13, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO14 ESP32_PINMUX(14, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO15 ESP32_PINMUX(15, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO16 ESP32_PINMUX(16, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO17 ESP32_PINMUX(17, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO18 ESP32_PINMUX(18, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO19 ESP32_PINMUX(19, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO20 ESP32_PINMUX(20, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO21 ESP32_PINMUX(21, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO26 ESP32_PINMUX(26, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO27 ESP32_PINMUX(27, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO28 ESP32_PINMUX(28, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO29 ESP32_PINMUX(29, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO30 ESP32_PINMUX(30, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO31 ESP32_PINMUX(31, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO32 ESP32_PINMUX(32, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO33 ESP32_PINMUX(33, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO34 ESP32_PINMUX(34, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO35 ESP32_PINMUX(35, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO36 ESP32_PINMUX(36, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO37 ESP32_PINMUX(37, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO38 ESP32_PINMUX(38, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO39 ESP32_PINMUX(39, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO40 ESP32_PINMUX(40, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO41 ESP32_PINMUX(41, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO42 ESP32_PINMUX(42, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO43 ESP32_PINMUX(43, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO44 ESP32_PINMUX(44, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO45 ESP32_PINMUX(45, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO46 ESP32_PINMUX(46, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO47 ESP32_PINMUX(47, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_D2_GPIO48 ESP32_PINMUX(48, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)

/* D3 (HD - Hold) - QSPI data line 3, bidirectional */
#define SPIM2_D3_GPIO0  ESP32_PINMUX(0,  ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO1  ESP32_PINMUX(1,  ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO2  ESP32_PINMUX(2,  ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO3  ESP32_PINMUX(3,  ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO4  ESP32_PINMUX(4,  ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO5  ESP32_PINMUX(5,  ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO6  ESP32_PINMUX(6,  ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO7  ESP32_PINMUX(7,  ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO8  ESP32_PINMUX(8,  ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO9  ESP32_PINMUX(9,  ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO10 ESP32_PINMUX(10, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO11 ESP32_PINMUX(11, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO12 ESP32_PINMUX(12, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO13 ESP32_PINMUX(13, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO14 ESP32_PINMUX(14, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO15 ESP32_PINMUX(15, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO16 ESP32_PINMUX(16, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO17 ESP32_PINMUX(17, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO18 ESP32_PINMUX(18, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO19 ESP32_PINMUX(19, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO20 ESP32_PINMUX(20, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO21 ESP32_PINMUX(21, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO26 ESP32_PINMUX(26, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO27 ESP32_PINMUX(27, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO28 ESP32_PINMUX(28, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO29 ESP32_PINMUX(29, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO30 ESP32_PINMUX(30, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO31 ESP32_PINMUX(31, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO32 ESP32_PINMUX(32, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO33 ESP32_PINMUX(33, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO34 ESP32_PINMUX(34, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO35 ESP32_PINMUX(35, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO36 ESP32_PINMUX(36, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO37 ESP32_PINMUX(37, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO38 ESP32_PINMUX(38, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO39 ESP32_PINMUX(39, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO40 ESP32_PINMUX(40, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO41 ESP32_PINMUX(41, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO42 ESP32_PINMUX(42, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO43 ESP32_PINMUX(43, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO44 ESP32_PINMUX(44, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO45 ESP32_PINMUX(45, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO46 ESP32_PINMUX(46, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO47 ESP32_PINMUX(47, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_D3_GPIO48 ESP32_PINMUX(48, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)

/* SPI3 QSPI Pin Definitions */

/* D0 (MOSI) for SPI3 */
#define SPIM3_D0_GPIO0  ESP32_PINMUX(0,  ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO1  ESP32_PINMUX(1,  ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO2  ESP32_PINMUX(2,  ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO3  ESP32_PINMUX(3,  ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO4  ESP32_PINMUX(4,  ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO5  ESP32_PINMUX(5,  ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO6  ESP32_PINMUX(6,  ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO7  ESP32_PINMUX(7,  ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO8  ESP32_PINMUX(8,  ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO9  ESP32_PINMUX(9,  ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO10 ESP32_PINMUX(10, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO11 ESP32_PINMUX(11, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO12 ESP32_PINMUX(12, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO13 ESP32_PINMUX(13, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO14 ESP32_PINMUX(14, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO15 ESP32_PINMUX(15, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO16 ESP32_PINMUX(16, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO17 ESP32_PINMUX(17, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO18 ESP32_PINMUX(18, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO19 ESP32_PINMUX(19, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO20 ESP32_PINMUX(20, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO21 ESP32_PINMUX(21, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO26 ESP32_PINMUX(26, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO27 ESP32_PINMUX(27, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO28 ESP32_PINMUX(28, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO29 ESP32_PINMUX(29, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO30 ESP32_PINMUX(30, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO31 ESP32_PINMUX(31, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO32 ESP32_PINMUX(32, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO33 ESP32_PINMUX(33, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO34 ESP32_PINMUX(34, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO35 ESP32_PINMUX(35, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO36 ESP32_PINMUX(36, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO37 ESP32_PINMUX(37, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO38 ESP32_PINMUX(38, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO39 ESP32_PINMUX(39, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO40 ESP32_PINMUX(40, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO41 ESP32_PINMUX(41, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO42 ESP32_PINMUX(42, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO43 ESP32_PINMUX(43, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO44 ESP32_PINMUX(44, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO45 ESP32_PINMUX(45, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO46 ESP32_PINMUX(46, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO47 ESP32_PINMUX(47, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)
#define SPIM3_D0_GPIO48 ESP32_PINMUX(48, ESP_SPI3_D_IN, ESP_SPI3_D_OUT)

/* D1 (MISO) for SPI3 */
#define SPIM3_D1_GPIO0  ESP32_PINMUX(0,  ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO1  ESP32_PINMUX(1,  ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO2  ESP32_PINMUX(2,  ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO3  ESP32_PINMUX(3,  ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO4  ESP32_PINMUX(4,  ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO5  ESP32_PINMUX(5,  ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO6  ESP32_PINMUX(6,  ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO7  ESP32_PINMUX(7,  ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO8  ESP32_PINMUX(8,  ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO9  ESP32_PINMUX(9,  ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO10 ESP32_PINMUX(10, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO11 ESP32_PINMUX(11, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO12 ESP32_PINMUX(12, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO13 ESP32_PINMUX(13, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO14 ESP32_PINMUX(14, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO15 ESP32_PINMUX(15, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO16 ESP32_PINMUX(16, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO17 ESP32_PINMUX(17, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO18 ESP32_PINMUX(18, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO19 ESP32_PINMUX(19, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO20 ESP32_PINMUX(20, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO21 ESP32_PINMUX(21, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO26 ESP32_PINMUX(26, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO27 ESP32_PINMUX(27, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO28 ESP32_PINMUX(28, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO29 ESP32_PINMUX(29, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO30 ESP32_PINMUX(30, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO31 ESP32_PINMUX(31, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO32 ESP32_PINMUX(32, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO33 ESP32_PINMUX(33, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO34 ESP32_PINMUX(34, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO35 ESP32_PINMUX(35, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO36 ESP32_PINMUX(36, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO37 ESP32_PINMUX(37, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO38 ESP32_PINMUX(38, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO39 ESP32_PINMUX(39, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO40 ESP32_PINMUX(40, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO41 ESP32_PINMUX(41, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO42 ESP32_PINMUX(42, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO43 ESP32_PINMUX(43, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO44 ESP32_PINMUX(44, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO45 ESP32_PINMUX(45, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO46 ESP32_PINMUX(46, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO47 ESP32_PINMUX(47, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)
#define SPIM3_D1_GPIO48 ESP32_PINMUX(48, ESP_SPI3_Q_IN, ESP_SPI3_Q_OUT)

/* D2 (WP - Write Protect) for SPI3 */
#define SPIM3_D2_GPIO0  ESP32_PINMUX(0,  ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO1  ESP32_PINMUX(1,  ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO2  ESP32_PINMUX(2,  ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO3  ESP32_PINMUX(3,  ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO4  ESP32_PINMUX(4,  ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO5  ESP32_PINMUX(5,  ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO6  ESP32_PINMUX(6,  ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO7  ESP32_PINMUX(7,  ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO8  ESP32_PINMUX(8,  ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO9  ESP32_PINMUX(9,  ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO10 ESP32_PINMUX(10, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO11 ESP32_PINMUX(11, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO12 ESP32_PINMUX(12, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO13 ESP32_PINMUX(13, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO14 ESP32_PINMUX(14, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO15 ESP32_PINMUX(15, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO16 ESP32_PINMUX(16, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO17 ESP32_PINMUX(17, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO18 ESP32_PINMUX(18, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO19 ESP32_PINMUX(19, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO20 ESP32_PINMUX(20, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO21 ESP32_PINMUX(21, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO26 ESP32_PINMUX(26, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO27 ESP32_PINMUX(27, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO28 ESP32_PINMUX(28, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO29 ESP32_PINMUX(29, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO30 ESP32_PINMUX(30, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO31 ESP32_PINMUX(31, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO32 ESP32_PINMUX(32, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO33 ESP32_PINMUX(33, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO34 ESP32_PINMUX(34, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO35 ESP32_PINMUX(35, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO36 ESP32_PINMUX(36, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO37 ESP32_PINMUX(37, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO38 ESP32_PINMUX(38, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO39 ESP32_PINMUX(39, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO40 ESP32_PINMUX(40, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO41 ESP32_PINMUX(41, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO42 ESP32_PINMUX(42, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO43 ESP32_PINMUX(43, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO44 ESP32_PINMUX(44, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO45 ESP32_PINMUX(45, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO46 ESP32_PINMUX(46, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO47 ESP32_PINMUX(47, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)
#define SPIM3_D2_GPIO48 ESP32_PINMUX(48, ESP_SPI3_WP_IN, ESP_SPI3_WP_OUT)

