Pavllick/eerie_leap_round_gauge/boards/waveshare/esp32s3_touch_amoled_1_75/esp32s3-qspi-pinctrl.h
/* D3 (HD - Hold) for SPI3 */
#define SPIM3_D3_GPIO0  ESP32_PINMUX(0,  ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO1  ESP32_PINMUX(1,  ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO2  ESP32_PINMUX(2,  ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO3  ESP32_PINMUX(3,  ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO4  ESP32_PINMUX(4,  ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO5  ESP32_PINMUX(5,  ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO6  ESP32_PINMUX(6,  ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO7  ESP32_PINMUX(7,  ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO8  ESP32_PINMUX(8,  ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO9  ESP32_PINMUX(9,  ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO10 ESP32_PINMUX(10, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO11 ESP32_PINMUX(11, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO12 ESP32_PINMUX(12, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO13 ESP32_PINMUX(13, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO14 ESP32_PINMUX(14, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO15 ESP32_PINMUX(15, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO16 ESP32_PINMUX(16, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO17 ESP32_PINMUX(17, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO18 ESP32_PINMUX(18, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO19 ESP32_PINMUX(19, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO20 ESP32_PINMUX(20, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO21 ESP32_PINMUX(21, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO26 ESP32_PINMUX(26, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO27 ESP32_PINMUX(27, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO28 ESP32_PINMUX(28, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO29 ESP32_PINMUX(29, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO30 ESP32_PINMUX(30, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO31 ESP32_PINMUX(31, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO32 ESP32_PINMUX(32, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO33 ESP32_PINMUX(33, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO34 ESP32_PINMUX(34, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO35 ESP32_PINMUX(35, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO36 ESP32_PINMUX(36, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO37 ESP32_PINMUX(37, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO38 ESP32_PINMUX(38, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO39 ESP32_PINMUX(39, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO40 ESP32_PINMUX(40, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO41 ESP32_PINMUX(41, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO42 ESP32_PINMUX(42, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO43 ESP32_PINMUX(43, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO44 ESP32_PINMUX(44, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO45 ESP32_PINMUX(45, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO46 ESP32_PINMUX(46, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO47 ESP32_PINMUX(47, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)
#define SPIM3_D3_GPIO48 ESP32_PINMUX(48, ESP_SPI3_HD_IN, ESP_SPI3_HD_OUT)

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_PINCTRL_ESP32S3_QSPI_PINCTRL_H_ */
